#define FORWARD true
#define BACKWARD false
#include "roll.h"         //ліва вісь на 6 7 8 9 пінах, права на 10 11 12 13
#include "rotation.h"     // задефайнити радіус колісної бази та 1 оберту колеса
#include "manipulator.h"  //база 5 пін, згин 4, згин клешні 3, зажим 2
void setup() {
base.attach(5); // підключення клешень
mid.attach(4);
clamp_rotate.attach(3);
clamp.attach(2);
/*інтерфейс для управління, roll_r і roll_l для http запитів при надатті бокових стрілок 
 * (зробимо їх виклик на 10 мм прокручення і повторитмо при повторному запиті чи як там,
 ліва вісь на 6 7 8 9 пінах, права на 10 11 12 13), похибка в домашніх умовах з обіссаного лего з кривим 1 колесом 2 см на метр 
 (важливо фіксанути добре колеса, люфт спричинить зміну траєкторії та заниження реального пройденого шляху), похибка оборотів відсутня, 
 при 30 оборотах за навантаженням зміщення не відбулось*/
  
roll(100, FORWARD);  // прокрутити всі колеса на 100 мм вперед
rotate(-60);         // обернути машинку на 60 градусів за годинникової стрілки (можна і за)
roll_r(50, FORWARD); //(прокрути на 50 мм праву вісь)
roll_l(50, FORWARD); //(прокрутити на 50 мм ліву вісь)
}

void loop() {
  // put your main code here, to run repeatedly:

}
